/*!*********************************************************************************************************************
\file         PVRCore\Types.h
\author       PowerVR by Imagination, Developer Technology Team
\copyright    Copyright (c) Imagination Technologies Limited.
\brief         Basic file used in the PowerVR Framework. Defines several types used throughout the Framework (sized arithmetic
              types, enumerations, character types).
***********************************************************************************************************************/
#pragma once

#pragma warning(disable:4512)
#pragma warning(disable:4480)
#pragma warning(disable:4100)

#include <vector>
#include <array>
#include <cmath>
#include <cstdio>
#include <cstdlib>
#include <cstddef>
#include <cstring>
#include <memory>
#include <algorithm>
#include <functional>
#include <string>

#include "PVRCore/HalfFloat.h"
#include "PVRCore/Assert_.h"


#if defined(_MSC_VER)
#define PVR_THREAD_LOCAL __declspec(thread)
#elif defined(__ANDROID__) //Unfortunately, no out-of-the box support for TLS on android.
#define PVR_THREAD_LOCAL
#elif true||defined(TARGET_OS_IPHONE)||defined(TARGET_IPHONE_SIMULATOR)
#define PVR_THREAD_LOCAL
#elif defined(__GNUC__) || defined(__clang__)
#define PVR_THREAD_LOCAL __thread
#elif (__cplusplus>=201103L)
#define PVR_THREAD_LOCAL thread_local
#else

/*!*******************************************************************************************
\brief  32-bit signed integer.
*********************************************************************************************/
typedef signed int             int32;
#if defined(_WIN32)

/*!*******************************************************************************************
\brief  64-bit signed integer.
*********************************************************************************************/
typedef signed __int64         int64;
#elif defined(__GNUC__)
__extension__
/*!*******************************************************************************************
\brief  64-bit signed integer.
*********************************************************************************************/
typedef signed long long       int64;
#else
/*!*******************************************************************************************
\brief  64-bit signed integer.
*********************************************************************************************/
typedef signed long long       int64;
#endif

//Unsigned Integer Types
/*!*******************************************************************************************
\brief  8-bit unsigned integer.
*********************************************************************************************/
typedef unsigned char          uint8;

/*!*******************************************************************************************
\brief  16-bit unsigned integer.
*********************************************************************************************/
typedef unsigned short         uint16;

/*!*******************************************************************************************
\brief  32-bit unsigned integer.
*********************************************************************************************/
typedef unsigned int           uint32;
//#if defined(_WIN32)
//typedef unsigned __int64       uint64;
//#else
typedef unsigned long long     uint64;
//#endif

//Floating Point
/*!*******************************************************************************************
\brief  16-bit floating point number (half-float).
*********************************************************************************************/
typedef HalfFloat           float16;

/*!*******************************************************************************************
\brief  32-bit floating point number (single-precision float).
*********************************************************************************************/
typedef float                  float32;

/*!*******************************************************************************************
\brief  64-bit floating point number (double-precision float).
*********************************************************************************************/
typedef double                 float64;


namespace internal {
// If the size of various types does not equal the expected size, throw a compiler error
PVR_STATIC_ASSERT(sizeof(byte) == 1, byte_size_invalid);
PVR_STATIC_ASSERT(sizeof(char8) == 1, char8_size_invalid);
PVR_STATIC_ASSERT(sizeof(utf8) == 1, utf8_size_invalid);
PVR_STATIC_ASSERT(sizeof(utf16) == 2, utf16_size_invalid);
PVR_STATIC_ASSERT(sizeof(utf32) == 4, utf32_size_invalid);
PVR_STATIC_ASSERT(sizeof(int8) == 1, int8_size_invalid);
PVR_STATIC_ASSERT(sizeof(int16) == 2, int16_size_invalid);
PVR_STATIC_ASSERT(sizeof(int32) == 4, int32_size_invalid);
PVR_STATIC_ASSERT(sizeof(int64) == 8, int64_size_invalid);
PVR_STATIC_ASSERT(sizeof(uint8) == 1, uint8_size_invalid);
PVR_STATIC_ASSERT(sizeof(uint16) == 2, uint16_size_invalid);
PVR_STATIC_ASSERT(sizeof(uint32) == 4, uint32_size_invalid);
PVR_STATIC_ASSERT(sizeof(uint64) == 8, uint64_size_invalid);
PVR_STATIC_ASSERT(sizeof(float16) == 2, float16_size_invalid);
PVR_STATIC_ASSERT(sizeof(float32) == 4, float32_size_invalid);
PVR_STATIC_ASSERT(sizeof(float64) == 8, float64_size_invalid);
}

/*!*********************************************************************************************************************
\brief         Enumeration of all API types supported by this implementation
***********************************************************************************************************************/
namespace Api {
enum Enum
{
	Unspecified = 0,
	//OpenGL,
	OpenGLES2,
	OpenGLES3,
	OpenGLES31,
	OpenGLESMaxVersion = OpenGLES31,
	Vulkan,
	Count,
};

/*!*******************************************************************************************
\brief  Get the api code
\return Api code
*********************************************************************************************/
inline const char* getApiCode(Enum api)
{
	static const char* ApiCodes[] =
	{
		"",
		"ES2",
		"ES3",
		"ES31",
		"VK",
	};
	return ApiCodes[api];
}

/*!*******************************************************************************************
